"""Найдите сумму цифр трехзначного числа.
Пример:
123 -> 6 (1 + 2 + 3)
100 -> 1 (1 + 0 + 0)"""

n = int(input('введите трезначное число '))
a = n % 10
b = (n//10)%10
c = n//100
result = a+b+c
print(result)
